# DockablePaneId Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DockablePaneId Members
DockablePaneId Class Constructors Methods Operators Properties See Also
---
The DockablePaneId type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DockablePaneId | Creates a new DockablePaneId instance. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Compares two Guid-based enum object based on their concrete class and GUID value.  (Inherited from GuidEnum.) |
| GetHashCode | Generates a hash code for this Guid-based enum object.  (Inherited from GuidEnum.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Compares two DockablePaneId instances. |
| Inequality | Compares two DockablePaneId instances. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Guid | The Guid of GUID-based enum object.  (Inherited from GuidEnum.) |

# See Also
DockablePaneId Class
Autodesk.Revit.UI Namespace